cf_billing/InformationRegisters/энргТехническаяВозможностьОРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргТехническаяВозможностьОРП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьВозможность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргТехническаяВозможностьОРП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает возможность ОРП.
//
// Параметры:
//  Строение		-	СправочникСсылка.энргСтроения.
//  Помещение		-	СправочникСсылка.энргПомещения.
//  ЕстьВозможность	-	Булево.
//
Процедура УстановитьВозможностьОРП(Строение, Помещение, ЕстьВозможность) Экспорт 

	ЗаписьРС = РегистрыСведений.энргТехническаяВозможностьОРП.СоздатьМенеджерЗаписи();
	
	ЗаписьРС.Строение 		 = Строение;
	ЗаписьРС.Помещение 		 = Помещение;
	ЗаписьРС.ЕстьВозможность = ЕстьВозможность;
	
	ЗаписьРС.Записать(Истина);

КонецПроцедуры

// Получает возможность ОРП.
//
// Параметры:
//  Строение	-	СправочникСсылка.энргСтроения.
//  Помещение	-	СправочникСсылка.энргПомещения.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьВозможностьОРП(Строение, Помещение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТехническаяВозможностьОРП.Строение КАК Строение,
		|	энргТехническаяВозможностьОРП.Помещение КАК Помещение,
		|	энргТехническаяВозможностьОРП.ЕстьВозможность КАК ЕстьВозможность,
		|	1 КАК Порядок
		|ИЗ
		|	РегистрСведений.энргТехническаяВозможностьОРП КАК энргТехническаяВозможностьОРП
		|ГДЕ
		|	энргТехническаяВозможностьОРП.Строение = &Строение
		|	И энргТехническаяВозможностьОРП.Помещение = &Помещение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргТехническаяВозможностьОРП.Строение,
		|	энргТехническаяВозможностьОРП.Помещение,
		|	энргТехническаяВозможностьОРП.ЕстьВозможность,
		|	2
		|ИЗ
		|	РегистрСведений.энргТехническаяВозможностьОРП КАК энргТехническаяВозможностьОРП
		|ГДЕ
		|	энргТехническаяВозможностьОРП.Строение = &Строение
		|	И энргТехническаяВозможностьОРП.Помещение = ЗНАЧЕНИЕ(справочник.энргпомещения.пустаяссылка)";
	
	Запрос.УстановитьПараметр("Строение",  Строение);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#КонецЕсли
